{
"articles": [
		{
            "author": "admin",
            "date": "12/05/2014",
            "header": "Thieves may regret stealing HP Elitebook Folio 1020 laptops",
            "text": "Thieves might regret stealing Hewlett-Packard's ultrathin Elitebook Folio 1020 laptops, which have a feature that turns them into nothing more than paperweights in case of theft.A special feature in the Elitebook Folio 1020 is an \"always on\" capability so the laptop can be tracked even when it's shut off, as with smartphones and tablets. If a laptop is lost or stolen, it can be tracked down to a specific location and data can be remotely wiped by a system administrator. HP is tailoring the always-on tracking feature for the company's Web-based Touchpoint Manager mobile-device management service. The laptops have an extremely low-power ARM-based chip that remains on to enable the tracking and GPS-like feature, and the Touchpoint Manager service can issue alerts and start wiping data if a laptop is stolen or lost. The Folio 1020 is designed to fit into BYOD (bring your own device) programs with its security and remote manageability features, said John Groden, director of product development at Hewlett-Packard. The new laptops are also among the company's thinnest ever, at 15.7 millimeters thick. They weigh up to 1.2 kilograms, offer nine hours of battery life and have 12.5-inch screens. The Folio 1020, which comes in two models, have solid-state drives, 720p webcams and no fans. The premium Elitebook Folio 1020 Special Edition model weighs 1 kilogram and is composed of materials including carbon fiber and magnesium lithium. The Elitebook Folio 1020, which does not have the same composition of materials, weighs 1.2 kilograms. The Special Edition screen has a resolution of 2560 x 1440 pixels, while the Elitebook 1020 model has a full high-definition screen. Pricing for the laptops was not immediately available. One comparable laptop could be Lenovo's 14-inch ThinkPad Carbon X1, which is 17.3 millimeters thick and considered one of the thinnest PCs available today. The Elitebook Folio 1020 models have Intel's latest Core M processors, which are also used in tablets, while the Carbon X1 runs on Intel's older Core processors code-named Haswell, which are considered faster but more power hungry. HP is also updating its Elitebook business laptops with new Intel Core chips code-named Broadwell, which are due for release early next year. The fifth-generation Core chips will go into the second-generation Elitebook 1040 G2, 820 G2, 840 G2, 850 G2, 720 G2, 740 G2 and 750 G2 laptops, all of which have different screen sizes. Prices for the laptops were not immediately available. HP is also updating its 11.6.inch EliteBook Revolve 810 G3, which retains its old design with a revolving screen. The new laptop has up to 12GB of RAM, and information about the price or processor was not immediately available."
        },
        
        {
            "author": "admin",
            "date": "12/05/2014",
            "header": "To grow in IoT, Cypress and Spansion plan $4 billion chip merger",
            "text": "The contraction of the semiconductor industry continued with embedded chip and flash memory makers Cypress Semiconductor and Spansion announcing a merger plan worth $4 billion. Both companies make flash memory and low-power circuits used in industrial equipment, medical instruments, smart devices and cars. For example, Spansion's microcontroller units are used in automotive braking systems. The merger makes sense with fast growth in the Internet of Things market, where industrial equipment with connectivity features could put the companies' products in high demand, said Jim McGregor, principal analyst at Tirias Research. The combined company could go after markets like industrial automation, smart cities and smart devices, McGregor said. \"Those are markets where you can carve out a niche without taking on the Qualcomms and Intels,\" McGregor said. \"I still see them as being a niche entity, but they are looking at intellectual property that will make them valuable.\" The combined company will have in-house wireless capabilities, which are key for data transfer between IoT devices. Both the companies also specialize in NOR and SRAM memory, which are used in industrial IoT equipment. \"Having the memory capability in-house is going to be a potential benefit,\" McGregor said. \"We have only a handful of memory manufacturers left.\" Spansion, which was a spin-off of Advanced Micro Devices, last year bought Fujitsu's microcontroller business and is doing interesting work in energy harvesting. The combined company will compete with Freescale, Atmel, STMicroelectronics and Texas Instruments. Freescale has in-house memory assets, while TI has a strong portfolio in analog and digital circuitry. Both companies are based in Silicon Valley. They say the merger could create a company with $2 billion in annual revenue. The deal will close in the first half of next year, the companies said in a joint statement."
        },        
        
        {
            "author": "admin",
            "date": "12/03/2014",
            "header": "China booming smartphone growth starts to fizzle",
            "text": "China's appetite for smartphones is starting to reach its limit, with growth in the once booming market expected to reach single digit levels next year. The country ranks as the world biggest market for the devices, brought on by its giant population and scores of local vendors peddling cheap Android handsets. Demand in the market was so high that in 2013 smartphone shipments to the country were up 64 percent year over year, according to research firm IDC. But the growth has cooled down in 2014, with IDC's projection putting the year-over-year growth at 20 percent. And future growth will slow even further.\"Over the next few years, we expect it to be in single digits,\" said IDC analyst Kiranjeet Kaur on Tuesday. Smartphone vendors are still shipping huge quantities to the country, but the market has been mostly tapped, she added. In this year's third quarter, China's smartphone shipments reached 105 million, up by only 1 million units from the previous quarter. It hasn't helped that the country's mobile carriers have recently cut device subsidies, further tempering smartphone sales, Kaur said. Unlike the U.S., which only has a handful of vendors, including Samsung Electronics and Apple, with a sizeable presence in the market, China has dozens of different players, both small and large, all fighting for a piece of the pie. About 87 percent of the shipments to the country come from domestic vendors such as networking gear supplier Huawei Technologies, PC maker Lenovo, and fast-rising Xiaomi, according to IDC analyst Kitty Fok. China's smartphone market is so saturated that earlier this month Lenovo, one of the country's biggest smartphone vendors, said the era of hyper-growth in the market has ended. \"If you want to win you have to find new growth areas,\" Lenovo's CEO said at the time."
        },
        
        {
            "author": "admin",
            "date": "12/01/2014",
            "header": "Smartphone growth to slow, IDC says",
            "text": "Smartphone growth will continue at nearly 10% annually through 2018, but that's well behind increases in recent years. IDC said Monday that global smartphone shipments in 2014 will reach nearly 1.3 billion units, an increase of 26% over 2013. But for 2015, IDC predicted, 1.4 billion smartphones will ship to retailers, only a 12% increase over 2014. In many markets, the slowdown is happening because so many users already have smartphones and keep them longer in some cases. Also, smartphone prices are dropping dramatically, primarily because of several Chinese manufacturers. Premium phones like the iPhone 6 will keep their average selling price, but better specs are turning up in more affordable models, IDC said.\"Consumers no longer have to go with a top-of-the-line handset to guarantee decent hardware quality or experience,\" said Melissa Chau, an IDC analyst, in a statement. For all of 2014, the average selling price of smartphones will be $297 (with no subsidy), and then drop to $241 by 2018. Android will dominate shipments in 2018, reaching about 80% (a decline from 82% in 2014). Meanwhile, iPhone will drop to 12.8% over the same period, compared to 13.8% in 2014. By 2018, iPhone will have 34% of all smartphone revenues, compared with 61% for Android. IDC said Android's dominance will hurt new operating systems like Tizen and Firefox.  Newer OSes won't be able to compete on lower prices and will need to offer a \"radically different appeal to gain any significant traction,\" IDC added."
        },
        
        {
            "author": "admin",
            "date": "12/01/2014",
            "header": "Microsoft moving value phones to United States",
            "text": "The RM-1062 also self-reports as the RM-1063, RM-1064, and RM-1065, AdDuplex noted. That essentially means it'll have derivatives for various markets: AdDuplex reports it's seen the phone in Finland, some Asian countries, and on AT&T's network within the United States. Specifically, AdDuplex found that the RM-1062 will have a 720p screen spread across a 5.7-inch display, a tad smaller than the six-inch screen used by the Lumia 1520 and 1320. While the Lumia 1520 was sold in the United States, the 1320 was shipped to markets like Vietnam as a lower-cost option. It now appears that Microsoft will be widening its net. AdDuplex also reported seeing the low-end RM-1069 phone (with 4-inch, 480x800-pixel display) in Asia, as well as the 5-inch RM-1072 phone in Finland. Value phones continue to be the most popular phones AdDuplex has seen on its network, and the Lumia 520 continues to dominate all other Windows Phone sales. But there's another bit of good news for those who detest fragmentation: Within the United States, over half of all available smartphones now run Windows Phone 8.1, the service said."
        },
                
        {
            "author": "admin",
            "date": "11/28/2014",
            "header": "Microsoft buys Acompli to enhance Outlook for iOS, Android",
            "text": "Founded in 2013, Acompli offers an iPhone and Android mobile e-mail client that streamlines many of the basic tasks around managing e-mail so they can be completed on the device itself, rather than by using a desktop client. Users have reported that the software works particularly well with Microsoft's Exchange e-mail servers. Microsoft offers a basic version of Outlook for iPhones, though thus far it has seemingly garnered only a lukewarm response from users. The free Acompli app offers advanced features such as the ability to view both calendar items and email side by side on the same screen. The calendar lets users email available times for proposed meetings and send a message when they are running late. Microsoft plans to pair the Acompli development team with the team for its own Outlook e-mail client. Terms of the deal were not disclosed, though IT trade website Re/Code has reported that the acquisition was worth more than US$200 million. After years of being mostly dormant in terms of new feature development, e-mail seems to be becoming a competitive battlefield for major enterprise software services providers, which are quickly appending new features to the decades-old technology. Last month, IBM previewed its next-generation e-mail client, called Verse, which also offered new management tools. Google is also undertaking a radical redesign of its e-mail service in an effort called Inbox."
        },
        
        {
            "author": "admin",
            "date": "11/20/2014",
            "header": "Thieves may regret stealing HP Elitebook Folio 1020 laptops AGAIN",
            "text": "Thieves might regret stealing Hewlett-Packard's ultrathin Elitebook Folio 1020 laptops, which have a feature that turns them into nothing more than paperweights in case of theft.A special feature in the Elitebook Folio 1020 is an \"always on\" capability so the laptop can be tracked even when it's shut off, as with smartphones and tablets. If a laptop is lost or stolen, it can be tracked down to a specific location and data can be remotely wiped by a system administrator. HP is tailoring the always-on tracking feature for the company's Web-based Touchpoint Manager mobile-device management service. The laptops have an extremely low-power ARM-based chip that remains on to enable the tracking and GPS-like feature, and the Touchpoint Manager service can issue alerts and start wiping data if a laptop is stolen or lost. The Folio 1020 is designed to fit into BYOD (bring your own device) programs with its security and remote manageability features, said John Groden, director of product development at Hewlett-Packard. The new laptops are also among the company's thinnest ever, at 15.7 millimeters thick. They weigh up to 1.2 kilograms, offer nine hours of battery life and have 12.5-inch screens. The Folio 1020, which comes in two models, have solid-state drives, 720p webcams and no fans. The premium Elitebook Folio 1020 Special Edition model weighs 1 kilogram and is composed of materials including carbon fiber and magnesium lithium. The Elitebook Folio 1020, which does not have the same composition of materials, weighs 1.2 kilograms. The Special Edition screen has a resolution of 2560 x 1440 pixels, while the Elitebook 1020 model has a full high-definition screen. Pricing for the laptops was not immediately available. One comparable laptop could be Lenovo's 14-inch ThinkPad Carbon X1, which is 17.3 millimeters thick and considered one of the thinnest PCs available today. The Elitebook Folio 1020 models have Intel's latest Core M processors, which are also used in tablets, while the Carbon X1 runs on Intel's older Core processors code-named Haswell, which are considered faster but more power hungry. HP is also updating its Elitebook business laptops with new Intel Core chips code-named Broadwell, which are due for release early next year. The fifth-generation Core chips will go into the second-generation Elitebook 1040 G2, 820 G2, 840 G2, 850 G2, 720 G2, 740 G2 and 750 G2 laptops, all of which have different screen sizes. Prices for the laptops were not immediately available. HP is also updating its 11.6.inch EliteBook Revolve 810 G3, which retains its old design with a revolving screen. The new laptop has up to 12GB of RAM, and information about the price or processor was not immediately available."
        },
        
        {
            "author": "admin",
            "date": "11/15/2014",
            "header": "SECOND TIME To grow in IoT, Cypress and Spansion plan $4 billion chip merger",
            "text": "The contraction of the semiconductor industry continued with embedded chip and flash memory makers Cypress Semiconductor and Spansion announcing a merger plan worth $4 billion. Both companies make flash memory and low-power circuits used in industrial equipment, medical instruments, smart devices and cars. For example, Spansion's microcontroller units are used in automotive braking systems. The merger makes sense with fast growth in the Internet of Things market, where industrial equipment with connectivity features could put the companies' products in high demand, said Jim McGregor, principal analyst at Tirias Research. The combined company could go after markets like industrial automation, smart cities and smart devices, McGregor said. \"Those are markets where you can carve out a niche without taking on the Qualcomms and Intels,\" McGregor said. \"I still see them as being a niche entity, but they are looking at intellectual property that will make them valuable.\" The combined company will have in-house wireless capabilities, which are key for data transfer between IoT devices. Both the companies also specialize in NOR and SRAM memory, which are used in industrial IoT equipment. \"Having the memory capability in-house is going to be a potential benefit,\" McGregor said. \"We have only a handful of memory manufacturers left.\" Spansion, which was a spin-off of Advanced Micro Devices, last year bought Fujitsu's microcontroller business and is doing interesting work in energy harvesting. The combined company will compete with Freescale, Atmel, STMicroelectronics and Texas Instruments. Freescale has in-house memory assets, while TI has a strong portfolio in analog and digital circuitry. Both companies are based in Silicon Valley. They say the merger could create a company with $2 billion in annual revenue. The deal will close in the first half of next year, the companies said in a joint statement."
        },        
        
        {
            "author": "admin",
            "date": "11/01/2014",
            "header": "SUDDENLY China booming smartphone growth starts to fizzle",
            "text": "China's appetite for smartphones is starting to reach its limit, with growth in the once booming market expected to reach single digit levels next year. The country ranks as the world biggest market for the devices, brought on by its giant population and scores of local vendors peddling cheap Android handsets. Demand in the market was so high that in 2013 smartphone shipments to the country were up 64 percent year over year, according to research firm IDC. But the growth has cooled down in 2014, with IDC's projection putting the year-over-year growth at 20 percent. And future growth will slow even further.\"Over the next few years, we expect it to be in single digits,\" said IDC analyst Kiranjeet Kaur on Tuesday. Smartphone vendors are still shipping huge quantities to the country, but the market has been mostly tapped, she added. In this year's third quarter, China's smartphone shipments reached 105 million, up by only 1 million units from the previous quarter. It hasn't helped that the country's mobile carriers have recently cut device subsidies, further tempering smartphone sales, Kaur said. Unlike the U.S., which only has a handful of vendors, including Samsung Electronics and Apple, with a sizeable presence in the market, China has dozens of different players, both small and large, all fighting for a piece of the pie. About 87 percent of the shipments to the country come from domestic vendors such as networking gear supplier Huawei Technologies, PC maker Lenovo, and fast-rising Xiaomi, according to IDC analyst Kitty Fok. China's smartphone market is so saturated that earlier this month Lenovo, one of the country's biggest smartphone vendors, said the era of hyper-growth in the market has ended. \"If you want to win you have to find new growth areas,\" Lenovo's CEO said at the time."
        },
        
        {
            "author": "admin",
            "date": "10/26/2014",
            "header": "Smartphone growth to slow, IDC says AGAIN!",
            "text": "Smartphone growth will continue at nearly 10% annually through 2018, but that's well behind increases in recent years. IDC said Monday that global smartphone shipments in 2014 will reach nearly 1.3 billion units, an increase of 26% over 2013. But for 2015, IDC predicted, 1.4 billion smartphones will ship to retailers, only a 12% increase over 2014. In many markets, the slowdown is happening because so many users already have smartphones and keep them longer in some cases. Also, smartphone prices are dropping dramatically, primarily because of several Chinese manufacturers. Premium phones like the iPhone 6 will keep their average selling price, but better specs are turning up in more affordable models, IDC said.\"Consumers no longer have to go with a top-of-the-line handset to guarantee decent hardware quality or experience,\" said Melissa Chau, an IDC analyst, in a statement. For all of 2014, the average selling price of smartphones will be $297 (with no subsidy), and then drop to $241 by 2018. Android will dominate shipments in 2018, reaching about 80% (a decline from 82% in 2014). Meanwhile, iPhone will drop to 12.8% over the same period, compared to 13.8% in 2014. By 2018, iPhone will have 34% of all smartphone revenues, compared with 61% for Android. IDC said Android's dominance will hurt new operating systems like Tizen and Firefox.  Newer OSes won't be able to compete on lower prices and will need to offer a \"radically different appeal to gain any significant traction,\" IDC added."
        },
        
        {
            "author": "admin",
            "date": "10/20/2014",
            "header": "AFTER ALL Microsoft moving value phones to United States",
            "text": "The RM-1062 also self-reports as the RM-1063, RM-1064, and RM-1065, AdDuplex noted. That essentially means it'll have derivatives for various markets: AdDuplex reports it's seen the phone in Finland, some Asian countries, and on AT&T's network within the United States. Specifically, AdDuplex found that the RM-1062 will have a 720p screen spread across a 5.7-inch display, a tad smaller than the six-inch screen used by the Lumia 1520 and 1320. While the Lumia 1520 was sold in the United States, the 1320 was shipped to markets like Vietnam as a lower-cost option. It now appears that Microsoft will be widening its net. AdDuplex also reported seeing the low-end RM-1069 phone (with 4-inch, 480x800-pixel display) in Asia, as well as the 5-inch RM-1072 phone in Finland. Value phones continue to be the most popular phones AdDuplex has seen on its network, and the Lumia 520 continues to dominate all other Windows Phone sales. But there's another bit of good news for those who detest fragmentation: Within the United States, over half of all available smartphones now run Windows Phone 8.1, the service said."
        },
                
        {
            "author": "admin",
            "date": "10/20/2014",
            "header": "SUDDENLY Microsoft buys Acompli to enhance Outlook for iOS, Android",
            "text": "Founded in 2013, Acompli offers an iPhone and Android mobile e-mail client that streamlines many of the basic tasks around managing e-mail so they can be completed on the device itself, rather than by using a desktop client. Users have reported that the software works particularly well with Microsoft's Exchange e-mail servers. Microsoft offers a basic version of Outlook for iPhones, though thus far it has seemingly garnered only a lukewarm response from users. The free Acompli app offers advanced features such as the ability to view both calendar items and email side by side on the same screen. The calendar lets users email available times for proposed meetings and send a message when they are running late. Microsoft plans to pair the Acompli development team with the team for its own Outlook e-mail client. Terms of the deal were not disclosed, though IT trade website Re/Code has reported that the acquisition was worth more than US$200 million. After years of being mostly dormant in terms of new feature development, e-mail seems to be becoming a competitive battlefield for major enterprise software services providers, which are quickly appending new features to the decades-old technology. Last month, IBM previewed its next-generation e-mail client, called Verse, which also offered new management tools. Google is also undertaking a radical redesign of its e-mail service in an effort called Inbox."
        }
	],
	
	"images": [
	
		{
			"href": "http://farm9.static.flickr.com/8608/15759328409_41648f60e1_b.jpg",
			"title": "Pas zebra",
			"src": "http://farm9.static.flickr.com/8608/15759328409_41648f60e1_s.jpg"
		},
		
		{
			"href": "http://farm8.static.flickr.com/7566/15920567526_35035db98d_b.jpg",
			"title": "From above",
			"src": "http://farm8.static.flickr.com/7566/15920567526_35035db98d_s.jpg"
		},
		
		{
			"href": "http://farm9.static.flickr.com/8617/15944114261_6a08b63e57_b.jpg",
			"title": "RATS&THUGS",
			"src": "http://farm9.static.flickr.com/8617/15944114261_6a08b63e57_s.jpg"
		},
		
		{
			"href": "http://farm8.static.flickr.com/7557/15328651363_6469f5edba_b.jpg",
			"title": "Sunset taken with a samsung note 4s",
			"src": "http://farm8.static.flickr.com/7557/15328651363_6469f5edba_s.jpg"
		}
			
	]
	

}
	
